;
; Note: shader requires additional functionality:
;       Use native low precision
;
; shader debug name: a215f65fa3535f007294c47ca0b73a88.pdb
; shader hash: a215f65fa3535f007294c47ca0b73a88
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:8-i16:16-i32:32-i64:64-f16:16-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%0 = type { i32, i32, i32, i32 }
%___rpsl_node_info_struct = type <{ i32, i32, i32, i32, i32 }>
%___rpsl_entry_desc_struct = type <{ i32, i32, i32, i32, i8*, i8* }>
%___rpsl_type_info_struct = type <{ i8, i8, i8, i8, i32, i32, i32 }>
%___rpsl_params_info_struct = type <{ i32, i32, i32, i32, i32, i16, i16 }>
%___rpsl_shader_ref_struct = type <{ i32, i32, i32, i32 }>
%___rpsl_pipeline_info_struct = type <{ i32, i32, i32, i32 }>
%___rpsl_pipeline_field_info_struct = type <{ i32, i32, i32, i32, i32, i32, i32, i32 }>
%___rpsl_pipeline_res_binding_info_struct = type <{ i32, i32, i32, i32 }>

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.7.0.3789 (rps-merge-dxc1_7_2212_squash, b8686eeb8)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !36, globals: !141)
!1 = !DIFile(filename: "renderer.rpsl", directory: "")
!2 = !{}
!3 = !{!4, !6, !15, !16, !26, !34}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1, line: 165, baseType: !5)
!5 = !DIBasicType(name: "uint64_t", size: 64, align: 64, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 166, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 166, size: 64, align: 32, elements: !8, templateParams: !12)
!8 = !{!9, !11}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 166, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 166, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !10)
!14 = !DITemplateValueParameter(name: "element_count", type: !10, value: i32 2)
!15 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 29, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 29, size: 128, align: 32, elements: !18, templateParams: !23)
!18 = !{!19, !20, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 29, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 29, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 29, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !17, file: !1, line: 29, baseType: !15, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !{!24, !25}
!24 = !DITemplateTypeParameter(name: "element", type: !15)
!25 = !DITemplateValueParameter(name: "element_count", type: !10, value: i32 4)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 36, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 36, size: 64, align: 32, elements: !28, templateParams: !32)
!28 = !{!29, !31}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 36, baseType: !30, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 36, baseType: !30, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !{!33, !14}
!33 = !DITemplateTypeParameter(name: "element", type: !30)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1, line: 128, baseType: !35)
!35 = !DIBasicType(name: "uint16_t", size: 16, align: 16, encoding: DW_ATE_unsigned)
!36 = !{!37, !77, !92, !118, !122, !125, !129, !132, !138}
!37 = !DISubprogram(name: "make_default_texture_view_from_desc", linkageName: "\01?make_default_texture_view_from_desc@@YA?AUtexture@@IUResourceDesc@@@Z", scope: !38, file: !38, line: 152, type: !39, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.texture*, i32, %struct.ResourceDesc*)* @"\01?make_default_texture_view_from_desc@@YA?AUtexture@@IUResourceDesc@@@Z")
!38 = !DIFile(filename: "./___rpsl_builtin_header_.rpsl", directory: "")
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !65, !66}
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "texture", file: !1, size: 288, align: 32, elements: !42)
!42 = !{!43, !44, !45, !46, !47, !54, !55, !56, !59, !62}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Resource", scope: !41, file: !1, baseType: !30, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ViewFormat", scope: !41, file: !1, baseType: !30, size: 32, align: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "TemporalLayer", scope: !41, file: !1, baseType: !30, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !41, file: !1, baseType: !30, size: 32, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "SubresourceRange", scope: !41, file: !1, baseType: !48, size: 96, align: 32, offset: 128)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "SubresourceRange", file: !1, size: 96, align: 32, elements: !49)
!49 = !{!50, !51, !52, !53}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "base_mip_level", scope: !48, file: !1, baseType: !35, size: 16, align: 16)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "mip_level_count", scope: !48, file: !1, baseType: !35, size: 16, align: 16, offset: 16)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "base_array_layer", scope: !48, file: !1, baseType: !30, size: 32, align: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "array_layer_count", scope: !48, file: !1, baseType: !30, size: 32, align: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "MinLodClamp", scope: !41, file: !1, baseType: !15, size: 32, align: 32, offset: 224)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ComponentMapping", scope: !41, file: !1, baseType: !30, size: 32, align: 32, offset: 256)
!56 = !DISubprogram(name: "create1D", linkageName: "\01?create1D@texture@@SA?AU1@IIIIII@Z", scope: !41, file: !1, type: !57, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!57 = !DISubroutineType(types: !58)
!58 = !{!41, !30, !30, !30, !30, !30, !30}
!59 = !DISubprogram(name: "create2D", linkageName: "\01?create2D@texture@@SA?AU1@IIIIIIIII@Z", scope: !41, file: !1, type: !60, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubroutineType(types: !61)
!61 = !{!41, !30, !30, !30, !30, !30, !30, !30, !30, !30}
!62 = !DISubprogram(name: "create3D", linkageName: "\01?create3D@texture@@SA?AU1@IIIIIII@Z", scope: !41, file: !1, type: !63, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{!41, !30, !30, !30, !30, !30, !30, !30}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !30)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "ResourceDesc", file: !1, size: 288, align: 32, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !66, file: !1, baseType: !30, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "TemporalLayers", scope: !66, file: !1, baseType: !30, size: 32, align: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !66, file: !1, baseType: !30, size: 32, align: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Width", scope: !66, file: !1, baseType: !30, size: 32, align: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Height", scope: !66, file: !1, baseType: !30, size: 32, align: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "DepthOrArraySize", scope: !66, file: !1, baseType: !30, size: 32, align: 32, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "MipLevels", scope: !66, file: !1, baseType: !30, size: 32, align: 32, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Format", scope: !66, file: !1, baseType: !30, size: 32, align: 32, offset: 224)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "SampleCount", scope: !66, file: !1, baseType: !30, size: 32, align: 32, offset: 256)
!77 = !DISubprogram(name: "make_default_buffer_view_from_desc", linkageName: "\01?make_default_buffer_view_from_desc@@YA?AUbuffer@@IUResourceDesc@@@Z", scope: !38, file: !38, line: 161, type: !78, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !65, !66}
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "buffer", file: !1, line: 159, size: 320, align: 64, elements: !81)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Resource", scope: !80, file: !1, line: 159, baseType: !30, size: 32, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ViewFormat", scope: !80, file: !1, line: 159, baseType: !30, size: 32, align: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "TemporalLayer", scope: !80, file: !1, line: 159, baseType: !30, size: 32, align: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !80, file: !1, line: 159, baseType: !30, size: 32, align: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !80, file: !1, line: 159, baseType: !5, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "SizeInBytes", scope: !80, file: !1, line: 159, baseType: !5, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Stride", scope: !80, file: !1, line: 159, baseType: !30, size: 32, align: 32, offset: 256)
!89 = !DISubprogram(name: "create", linkageName: "\01?create@buffer@@SA?AU1@_KII@Z", scope: !80, file: !1, line: 159, type: !90, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false)
!90 = !DISubroutineType(types: !91)
!91 = !{!80, !5, !30, !30}
!92 = !DISubprogram(name: "main", linkageName: "\01?main@@YAXUtexture@@0_NV?$vector@H$01@@V?$matrix@M$03$03@@I@Z", scope: !1, file: !1, line: 14, type: !93, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.texture*, %struct.texture*, i1, <2 x i32>, %class.matrix.float.4.4, i32)* @rpsl_M_renderer_Fn_main)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !41, !41, !95, !6, !96, !65}
!95 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 166, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 166, size: 512, align: 32, elements: !98, templateParams: !115)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !97, file: !1, line: 166, baseType: !15, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!115 = !{!24, !116, !117}
!116 = !DITemplateValueParameter(name: "row_count", type: !10, value: i32 4)
!117 = !DITemplateValueParameter(name: "col_count", type: !10, value: i32 4)
!118 = !DISubprogram(name: "make_default_texture_view", linkageName: "\01?make_default_texture_view@@YA?AUtexture@@IIII@Z", scope: !38, file: !38, line: 119, type: !119, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!119 = !DISubroutineType(types: !120)
!120 = !{!41, !65, !121, !65, !65}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "RPS_FORMAT", file: !1, line: 65, baseType: !30)
!122 = !DISubprogram(name: "make_default_buffer_view", linkageName: "\01?make_default_buffer_view@@YA?AUbuffer@@I_K@Z", scope: !38, file: !38, line: 137, type: !123, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false)
!123 = !DISubroutineType(types: !124)
!124 = !{!80, !65, !4}
!125 = !DISubprogram(name: "create_tex2d", linkageName: "\01?create_tex2d@@YA?AUtexture@@IIIIIIIII@Z", scope: !38, file: !38, line: 216, type: !126, isLocal: false, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: false)
!126 = !DISubroutineType(types: !127)
!127 = !{!41, !121, !65, !65, !65, !65, !65, !65, !65, !128}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "RPS_RESOURCE_FLAGS", file: !1, line: 361, baseType: !30)
!129 = !DISubprogram(name: "___rpsl_canonicalize_mip_level", linkageName: "\01?___rpsl_canonicalize_mip_level@@YAIIIIII@Z", scope: !38, file: !38, line: 96, type: !130, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false)
!130 = !DISubroutineType(types: !131)
!131 = !{!65, !65, !65, !65, !65, !65}
!132 = !DISubprogram(name: "clear", linkageName: "\01?clear@@YA?AUnodeidentifier@@Utexture@@V?$vector@M$03@@@Z", scope: !38, file: !38, line: 292, type: !133, isLocal: false, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: false)
!133 = !DISubroutineType(types: !134)
!134 = !{!135, !41, !16}
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "nodeidentifier", file: !38, line: 2, size: 32, align: 32, elements: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !135, file: !38, line: 2, baseType: !65, size: 32, align: 32)
!138 = !DISubprogram(name: "clear", linkageName: "\01?clear@@YA?AUnodeidentifier@@Utexture@@MI@Z", scope: !38, file: !38, line: 302, type: !139, isLocal: false, isDefinition: true, scopeLine: 303, flags: DIFlagPrototyped, isOptimized: false)
!139 = !DISubroutineType(types: !140)
!140 = !{!135, !41, !15, !65}
!141 = !{!142, !144, !145, !146, !147, !148, !152, !155}
!142 = !DIGlobalVariable(name: "RPS_RESOURCE_TEX3D", scope: !0, file: !1, line: 157, type: !143, isLocal: true, isDefinition: true, variable: i32 4)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!144 = !DIGlobalVariable(name: "RPS_FORMAT_R16G16B16A16_FLOAT", scope: !0, file: !1, line: 22, type: !143, isLocal: true, isDefinition: true, variable: i32 10)
!145 = !DIGlobalVariable(name: "RPS_FORMAT_D32_FLOAT_S8X24_UINT", scope: !0, file: !1, line: 26, type: !143, isLocal: true, isDefinition: true, variable: i32 20)
!146 = !DIGlobalVariable(name: "RPS_RESOLVE_MODE_AVERAGE", scope: !0, file: !1, line: 36, type: !143, isLocal: true, isDefinition: true, variable: i32 0)
!147 = !DIGlobalVariable(name: "RPS_FORMAT_UNKNOWN", scope: !0, file: !1, line: 124, type: !143, isLocal: true, isDefinition: true, variable: i32 0)
!148 = !DIGlobalVariable(name: "___rpsl_pso_tmp", scope: !0, file: !38, line: 361, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pipeline", file: !1, line: 361, size: 32, align: 32, elements: !150)
!150 = !{!151}
